{"education":[{"institution":"Universidad de Chile","location":"Santiago, Chile","url":"https://magister.dim.uchile.cl","area":"Matemáticas Aplicadas","studyType":"M.Sc","startDate":"2023-03-01","endDate":"2024-10-11","score":"GPA de 4.0 (6.8/7.0)","courses":["Aprendizaje Automático Avanzado","Simulación Estocástica","Probabilidad y Estadística en el Análisis de Datos"]},{"institution":"Universidad de Chile","location":"Santiago, Chile","url":"https://www.uzh.ch/","area":"Ingeniería Matemática","studyType":"B.Sc","startDate":"2019-03-01","endDate":"2022-12-01","score":"GPA de 3.7 (6.2/7.0)","courses":["Deep Learning","Cálculo Estocástico","Optimización No Lineal"]},{"institution":"Universidad de Chile","location":"Santiago, Chile","url":"https://www.uzh.ch/","area":"Computación","studyType":"Minor","startDate":"2021-03-01","endDate":"2022-12-01","score":"GPA de 4.0 (6.8/7.0)","courses":["Bases de Datos","Algoritmos y Estructuras de Datos","Metodología de Diseño y Programación","Ingeniería de Software"]}],"work":[{"name":"Bloom","position":"Desarrollador IA/ML","location":"Santiago, Chile","url":"https://bloomalert.com","startDate":"2025-05-02","endDate":"to date","summary":"Como Desarrollador de IA/ML, me especializo en el diseño, implementación y optimización de soluciones de datos de extremo a extremo. Mi rol se enfoca en construir y mantener pipelines de MLOps robustos y escalables en Google Cloud Platform, asegurando el rendimiento y la fiabilidad de los modelos predictivos que mejoran la eficiencia en procesos industriales para la industria del agua.","highlights":["Desarrollé e implementé una lógica de alertas predictivas que minimizó las detenciones no programadas y extendió la vida útil de los filtros, liderando además la estandarización de su documentación técnica.","Automaticé el reporting de rendimiento de alertas (Kedro, Quarto), utilizando análisis de series temporales para reducir significativamente los falsos positivos del sistema.","Participé en la migración de ETLs a una arquitectura serverless en GCP (CI/CD, Docker), donde diseñé un template de código que redujo el tiempo de desarrollo en un 60% y mejoró la escalabilidad.","Automaticé el monitoreo de ETLs desarrollando una Cloud Function con notificaciones en Slack, reduciendo el tiempo de respuesta a incidentes de horas a minutos y eliminando la supervisión manual.","Stacks: Data Science | GCP | Docker | CI/CD | Kedro | Quarto"]},{"name":"Centro Nacional en Inteligencia Artificial (CENIA)","position":"Asistente de Investigación","location":"Santiago, Chile","url":"https://cenia.cl","startDate":"2024-10-15","endDate":"2025-01-31","summary":"Desarrollé un pipeline de procesamiento de imágenes satelitales para analizar la evolución de incendios forestales en Chile, optimizando su eficiencia y escalabilidad.","highlights":["Analicé datos de incendios forestales en Chile, extrayendo métricas clave para su segmentación.","Automatizé la descarga y preprocesamiento de imágenes satelitales, mejorando la eficiencia del flujo de datos.","Optimicé consultas en Google Earth Engine, acelerándolas en un 100x.","Contribuí con mejoras a la librería geetools, beneficiando a la comunidad.","Stacks: Google Earth Engine | geopandas | geetools | scikit-learn"]},{"name":"Centro de Modelamiento Matemático (CMM)","position":"Estudiante de Tesis de Magíster","location":"Santiago, Chile","url":"https://www.cmm.uchile.cl","startDate":"2022-12-01","endDate":"2025-04-30","summary":"Calculé el baricentro de Wasserstein Bayesiano (BWB) en un conjunto de imágenes utilizando el algoritmo del descenso del gradiente estocástico sobre el espacio de Wasserstein (WSGD).","highlights":["Implementé el algoritmo WSGD de forma abstracta, facilitando su uso por otros investigadores.","Desarrollé Redes Generativas Adversarias de Wasserstein (WGAN), optimizando la velocidad de entrenamiento en un factor de x3.","Extendí la arquitectura de WGAN incorporando un Autoencoder (AE), permitiendo tener un proyector sobre la variedad de imágenes.","Aproximé la distribución a posteriori utilizando GANs como distribución a priori, obteniendo muestras mediante el algoritmo de Markov Chain Monte Carlo (MCMC).","Desarrollé una librería para procesar y limpiar el conjunto de datos Quick, Draw!, implementando algoritmos de clusterización para mejorar la calidad del conjunto.","Stacks: PyTorch | WGAN | Autoencoders | MCMC | NUTS | Scikit-learn | Clusterización | UMAP | Tensorboard"]},{"name":"Centro de Modelamiento Matemático (CMM)","position":"Asistente de Investigación","location":"Santiago, Chile","url":"https://www.cmm.uchile.cl","startDate":"2022-08-01","endDate":"2023-01-31","summary":"Realicé ingeniería de características en datos sísmicos y apliqué el proceso de Hawkes para la predicción probabilística espaciotemporal de estallidos de roca.","highlights":["Desarrollé procesos para transformar datos sísmicos crudos en características relevantes, necesario para su uso en modelos predictivos.","Implementé el proceso de Hawkes para realizar predicciones probabilísticas espaciotemporales de estallidos de roca.","Stacks: Procesos Estocásticos | Procesos de Hawkes | Feature Engineering"]},{"name":"Copenhagen Business School (CBS)","position":"Asistente de Investigación","location":"Copenhague, Dinamarca","url":"https://www.cbs.dk","startDate":"2024-06-01","endDate":"2024-07-31","summary":"Investigué y propuse nuevas aplicaciones del baricentro de Wasserstein Bayesiano en el contexto de modelos de fairness.","highlights":["Stacks: Fairness Models | Investigación | Baricentros de Wasserstein"]},{"name":"Análisis de la Correlación entre Metodologías de Enseñanza Inclusiva y el Rendimiento Académico de Estudiantes de Educación Primaria","position":"Freelance","location":"Santiago, Chile","startDate":"2022-11-30","endDate":"2023-01-08","summary":"Realicé un análisis estadístico para estudiar la correlación entre las metodologías de enseñanza inclusiva y el rendimiento académico en estudiantes de educación primaria.","highlights":["Utilicé técnicas de análisis de datos y visualización para presentar los resultados de forma clara.","Apliqué técnicas estadísticas para identificar patrones clave entre las metodologías de enseñanza y el rendimiento académico.","Realicé un análisis de correlación categórica-numérica y tests de hipótesis para validar los resultados.","Desarrollé un modelo de regresión logística para predecir el rendimiento académico.","Stacks: Estadística | Test de Hipótesis | Regresión Logística | Pandas | Scikit-learn"]},{"name":"Voyager Health","position":"Científico de Datos","location":"Santiago, Chile","startDate":"2022-01-01","endDate":"2022-02-31","summary":"Predije el índice INR en pacientes bajo tratamiento con anticoagulante oral.","highlights":["Analicé estadísticamente las series temporales de INR, identificando patrones clave.","Implementé redes neuronales recurrentes en TensorFlow y Keras, optimizando el flujo de entrenamiento.","Stacks: Series Temporales | Redes Neuronales Recurrentes | TensorFlow | Keras | Estadística"]},{"name":"Asignación de Servicios de Internet en Comunidades Vulnerables","position":"Freelance","location":"Santiago, Chile","startDate":"2021-09-21","endDate":"2021-12-17","summary":"Desarrollé un modelo de optimización para asignar servicios de Internet en comunidades vulnerables.","highlights":["Formulé un modelo de optimización del tipo de transporte óptimo con restricciones de capacidad y demanda.","Stacks: Optimización | Investigación de Operaciones | Programación Matemática | Python | PuLP"]},{"name":"SimpliRoute","position":"Científico de Datos","location":"Santiago, Chile","url":"https://simpliroute.com/es","startDate":"2021-01-01","endDate":"2021-03-05","summary":"Desarrollé algoritmos para detección de anomalías en datos georreferenciados y análisis de tiempos de servicio.","highlights":["Implementé métodos de clustering para identificar datos georreferenciados anómalos, mejorando la calidad de los datos.","Desarrollé un sistema avanzado de detección de tiempos de servicio, mejorando la planificación logística.","Desplegué estadísticas clave para análisis y toma de decisiones estratégicas.","Stacks: Machine Learning | Clustering | Análisis Geoespacial | Python | Scikit-learn | Pandas"]},{"name":"SARCAN","position":"Ingeniero en Investigación y Desarrollo e Investigador en Práctica","location":"Santiago, Chile","url":"http://www.sarcan.cl","startDate":"2020-01-01","endDate":"2020-08-31","summary":"Desarrollé modelos de optimización para mejorar la planificación de rutas y eficiencia en el transporte interurbano.","highlights":["Diseñé un plan de acción para mejorar la eficiencia operativa del transporte. Este plan de acción se sigue implementando en la actualidad.","Implementé modelos de optimización para mejorar la planificación de rutas.","Stacks: Optimización | Investigación de Operaciones | Programación Matemática | Python | PuLP"]}],"languages":[{"language":"Español","fluency":"Nativo","icon":""},{"language":"Inglés","fluency":"B1 (TOEFL ITP)","icon":""}],"certificates":[{"name":"Curso Maestro de Python 3","date":"2020-04-03","issuer":"Udemy","url":"https://www.udemy.com/certificate/UC-1c919070-ee26-4d11-be64-6f46c0ef59cc/","icon":"fa-brands fa-python"},{"name":"Redes Neuronales y Deep Learning","date":"2020-08-27","issuer":"DeepLearning.AI","url":"https://coursera.org/share/d1beff6f0fca099ab19cc3f78b1d34f4","icon":"fa-solid fa-brain"},{"name":"Curso Avanzado de Series Temporales con R y Python","date":"2022-03-01","issuer":"Udemy","url":"https://www.udemy.com/certificate/UC-7ba29df2-45b6-4a68-aece-c3031c55037a/","icon":"fa-solid fa-arrow-trend-up"},{"name":"Curso de Certificación en C++","date":"2024-10-01","issuer":"Programming Hub","url":"https://storage.googleapis.com/programminghub/certificate%2F1727796937127.jpg","icon":"fa-solid fa-square-binary"}],"volunteer":[{"organization":"Instituto Milenio Fundamento de los Datos (IMFD)","position":"Monitor en Arduino Quest: Niñas PRO","url":"https://ninaspro.cl/#/potencia/","startDate":"2020-07-01","endDate":"2023-07-31","summary":"Guié a las alumnas en el desarrollo de un proyecto de Arduino.","highlights":["Participé en los talleres de los años 2020 y 2023."]},{"organization":"CONICYT","position":"Monitor en el Taller de IA para Escolares con Scratch","startDate":"2020-07-02","endDate":"2020-07-31","summary":"Enseñé a los alumnos a comprender, construir y utilizar un clasificador de Naive Bayes en Scratch.","highlights":[]},{"organization":"Campeonato de Matemáticas (CMAT)","position":"Equipo Académico","url":"https://organization.com/","startDate":"2019-03-01","endDate":"2020-12-31","summary":"Redacté preguntas, corregí pruebas y respondí consultas durante la competencia.","highlights":[]}]}